{"sample_id": "QReCC-Train_7625_2", "cur_utt_text": "When was the movie released", "oracle_utt_text": "When was the moview Amadeus released", "ctx_utts_text": ["how does mozart die in the movie amadeus"], "ctx_resps_text": ["Mozart suddenly came down with fever and was wracked with pain.In the following days his health significantly deteriorated. He died on December 5 after lapsing into a coma."]}
{"sample_id": "QReCC-Train_2626_9", "cur_utt_text": "Were there any other conflcts?", "oracle_utt_text": "Were there any other conflcts between Moynier and Henry Dunant after Henry Dunant left the committee?", "ctx_utts_text": ["When did Henry Dunant found the red cross?", "Did anything significant happen at that first meeting?", "What happened after the meeting?", "Why did they disagree?", "How did Dunant react?", "Did they resolve their conflicts?", "Did they continue to serve on the committee together?", "Did Moynier leave the committe?"], "ctx_resps_text": ["17 February 1863", "Their aim was to examine the feasibility of Dunant's ideas and to organize an international conference about their possible implementation.", "From early on, Moynier and Dunant had increasing disagreements and conflicts regarding their respective visions and plans.", "Moynier considered Dunant's idea to establish neutrality protections for care providers unfeasible and advised Dunant not to insist upon this concept.", "Dunant continued to advocate this position in his travels and conversations with high-ranking political and military figures.", "This intensified the personal conflict between Moynier, who took a rather pragmatic approach to the project, and Dunant, who was the idealist among the five.", "Dunant's businesses in Algeria had suffered. The social outcry in Geneva, a city deeply rooted in Calvinist traditions, also led to calls for him to separate himself from the International Committee.", "Moynier, became President of the Committee in 1864."]}
{"sample_id": "QReCC-Train_4611_3", "cur_utt_text": "Did he win any titles in his career?", "oracle_utt_text": "Did Rocky Graziano win any titles in his career?", "ctx_utts_text": ["What is something Rocky Graziano did in his professional career?", "Did he win the match?"], "ctx_resps_text": ["In March 1945, at Madison Square Garden, Rocky Graziano scored a major upset over Billy Arnold.", "Following his loss to Rocky Graziano, Billy Arnold was never the same."]}
